In [4]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np

In [5]:
df2 = pd.read_csv("C:/Users/Elechiguerra/Desktop/IRONHACK-DataScience/Unit5-EDA/project2/data_project2/df_final_web_data_pt_2.txt")

In [6]:
df1= pd.read_csv("C:/Users/Elechiguerra/Desktop/IRONHACK-DataScience/Unit5-EDA/project2/data_project2/df_final_web_data_pt_1.txt")

In [7]:
df_merged = pd.merge(df1, df2, on= "client_id")
df_merged

,client_id,visitor_id_x,visit_id_x,process_step_x,date_time_x,visitor_id_y,visit_id_y,process_step_y,date_time_y
0,438567,923318467_50708963627,711884648_43943594307_585328,step_1,2017-04-05 16:06:35,694624747_14580652583,787486191_38787201768_120150,confirm,2017-06-08 16:46:39
1,438567,923318467_50708963627,711884648_43943594307_585328,step_1,2017-04-05 16:06:35,694624747_14580652583,787486191_38787201768_120150,step_3,2017-06-08 16:46:08
2,438567,923318467_50708963627,711884648_43943594307_585328,step_1,2017-04-05 16:06:35,694624747_14580652583,787486191_38787201768_120150,step_2,2017-06-08 16:45:09
3,438567,923318467_50708963627,711884648_43943594307_585328,step_1,2017-04-05 16:06:35,694624747_14580652583,787486191_38787201768_120150,step_1,2017-06-08 16:44:30
4,438567,923318467_50708963627,711884648_43943594307_585328,step_1,2017-04-05 16:06:35,694624747_14580652583,787486191_38787201768_120150,start,2017-06-08 16:44:07
...,...,...,...,...,...,...,...,...,...
160781,2443347,465784886_73090545671,136329900_10529659391_316129,confirm,2017-03-31 15:15:46,818414719_69544570654,148166449_67114410166_524360,confirm,2017-05-30 19:18:18
160782,2443347,465784886_73090545671,136329900_10529659391_316129,step_3,2017-03-31 15:14:53,818414719_69544570654,148166449_67114410166_524360,confirm,2017-05-30 19:18:18
160783,2443347,465784886_73090545671,136329900_10529659391_316129,step_2,2017-03-31 15:12:08,818414719_69544570654,148166449_67114410166_524360,confirm,2017-05-30 19:18:18
160784,2443347,465784886_73090545671,136329900_10529659391_316129,step_1,2017-03-31 15:11:37,818414719_69544570654,148166449_67114410166_524360,confirm,2017-05-30 19:18:18
160785,2443347,465784886_73090545671,136329900_10529659391_316129,start,2017-03-31 15:10:47,818414719_69544570654,148166449_67114410166_524360,confirm,2017-05-30 19:18:18

In [8]:
df3= pd.read_csv("C:/Users/Elechiguerra/Desktop/IRONHACK-DataScience/Unit5-EDA/project2/data_project2/df_final_demo.txt")

In [9]:
df3

,client_id,clnt_tenure_yr,clnt_tenure_mnth,clnt_age,gendr,num_accts,bal,calls_6_mnth,logons_6_mnth
0,836976,6.0,73.0,60.5,U,2.0,45105.30,6.0,9.0
1,2304905,7.0,94.0,58.0,U,2.0,110860.30,6.0,9.0
2,1439522,5.0,64.0,32.0,U,2.0,52467.79,6.0,9.0
3,1562045,16.0,198.0,49.0,M,2.0,67454.65,3.0,6.0
4,5126305,12.0,145.0,33.0,F,2.0,103671.75,0.0,3.0
...,...,...,...,...,...,...,...,...,...
70604,7993686,4.0,56.0,38.5,U,3.0,1411062.68,5.0,5.0
70605,8981690,12.0,148.0,31.0,M,2.0,101867.07,6.0,6.0
70606,333913,16.0,198.0,61.5,F,2.0,40745.00,3.0,3.0
70607,1573142,21.0,255.0,68.0,M,3.0,475114.69,4.0,4.0
70608,5602139,21.0,254.0,59.5,F,3.0,157498.73,7.0,7.0

In [10]:
df4= pd.read_csv("C:/Users/Elechiguerra/Desktop/IRONHACK-DataScience/Unit5-EDA/project2/data_project2/df_final_experiment_clients.txt")

In [11]:
df4

       client_id Variation
0        9988021      Test
1        8320017      Test
2        4033851   Control
3        1982004      Test
4        9294070   Control
...          ...       ...
70604    2443347       NaN
70605    8788427       NaN
70606     266828       NaN
70607    1266421       NaN
70608    9895983       NaN

[70609 rows x 2 columns]

In [12]:
df_merged.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 160786 entries, 0 to 160785
Data columns (total 9 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   client_id       160786 non-null  int64
 1   visitor_id_x    160786 non-null  object
 2   visit_id_x      160786 non-null  object
 3   process_step_x  160786 non-null  object
 4   date_time_x     160786 non-null  object
 5   visitor_id_y    160786 non-null  object
 6   visit_id_y      160786 non-null  object
 7   process_step_y  160786 non-null  object
 8   date_time_y     160786 non-null  object
dtypes: int64(1), object(8)
memory usage: 11.0+ MB

In [13]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 70609 entries, 0 to 70608
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   client_id         70609 non-null  int64
 1   clnt_tenure_yr    70595 non-null  float64
 2   clnt_tenure_mnth  70595 non-null  float64
 3   clnt_age          70594 non-null  float64
 4   gendr             70595 non-null  object
 5   num_accts         70595 non-null  float64
 6   bal               70595 non-null  float64
 7   calls_6_mnth      70595 non-null  float64
 8   logons_6_mnth     70595 non-null  float64
dtypes: float64(7), int64(1), object(1)
memory usage: 4.8+ MB

In [14]:
df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 70609 entries, 0 to 70608
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   client_id  70609 non-null  int64
 1   Variation  50500 non-null  object
dtypes: int64(1), object(1)
memory usage: 1.1+ MB

In [15]:
list(set(df_merged.dtypes.tolist()))

[dtype('int64'), dtype('O')]

In [16]:
df_merged.select_dtypes("number").columns

Index(['client_id'], dtype='object')

In [17]:
df_merged.select_dtypes("number").nunique().sort_values(ascending=False)

client_id    5664
dtype: int64

In [18]:
# Checking for missing data
df_merged.isnull().sum().sort_values(ascending=False)

client_id         0
visitor_id_x      0
visit_id_x        0
process_step_x    0
date_time_x       0
visitor_id_y      0
visit_id_y        0
process_step_y    0
date_time_y       0
dtype: int64

In [ ]:
# df3

In [19]:
list(set(df3.dtypes.tolist()))

[dtype('int64'), dtype('O'), dtype('float64')]

In [20]:
df3.select_dtypes("number").columns

Index(['client_id', 'clnt_tenure_yr', 'clnt_tenure_mnth', 'clnt_age',
       'num_accts', 'bal', 'calls_6_mnth', 'logons_6_mnth'],
      dtype='object')

In [21]:
df3.select_dtypes("number").nunique().sort_values(ascending=False)

client_id           70609
bal                 70328
clnt_tenure_mnth      482
clnt_age              165
clnt_tenure_yr         54
logons_6_mnth           9
num_accts               8
calls_6_mnth            8
dtype: int64

In [23]:
# Checking for missing data df3
df3.isnull().sum().sort_values(ascending=False)

clnt_age            15
clnt_tenure_yr      14
clnt_tenure_mnth    14
gendr               14
num_accts           14
bal                 14
calls_6_mnth        14
logons_6_mnth       14
client_id            0
dtype: int64

In [ ]:
# df4

In [24]:
list(set(df4.dtypes.tolist()))

[dtype('int64'), dtype('O')]

In [25]:
df4.select_dtypes("number").columns

Index(['client_id'], dtype='object')

In [26]:
df4.select_dtypes("number").nunique().sort_values(ascending=False)

client_id    70609
dtype: int64

In [27]:
# Checking for missing data df4
df4.isnull().sum().sort_values(ascending=False)

Variation    20109
client_id        0
dtype: int64

In [28]:
df_merged.describe()

          client_id
count  1.607860e+05
mean   5.028800e+06
std    2.844869e+06
min    1.643000e+03
25%    2.565627e+06
50%    5.100333e+06
75%    7.409605e+06
max    9.999729e+06

In [29]:
df3.describe()

,client_id,clnt_tenure_yr,clnt_tenure_mnth,clnt_age,num_accts,bal,calls_6_mnth,logons_6_mnth
count,7.060900e+04,70595.000000,70595.000000,70594.000000,70595.000000,7.059500e+04,70595.000000,70595.000000
mean,5.004992e+06,12.052950,150.659367,46.442240,2.255528,1.474452e+05,3.382478,5.566740
std,2.877278e+06,6.871819,82.089854,15.591273,0.534997,3.015087e+05,2.236580,2.353286
min,1.690000e+02,2.000000,33.000000,13.500000,1.000000,1.378942e+04,0.000000,1.000000
25%,2.519329e+06,6.000000,82.000000,32.500000,2.000000,3.734683e+04,1.000000,4.000000
50%,5.016978e+06,11.000000,136.000000,47.000000,2.000000,6.333290e+04,3.000000,5.000000
75%,7.483085e+06,16.000000,192.000000,59.000000,2.000000,1.375449e+05,6.000000,7.000000
max,9.999839e+06,62.000000,749.000000,96.000000,8.000000,1.632004e+07,7.000000,9.000000

In [30]:
df4.describe()

          client_id
count  7.060900e+04
mean   5.004992e+06
std    2.877278e+06
min    1.690000e+02
25%    2.519329e+06
50%    5.016978e+06
75%    7.483085e+06
max    9.999839e+06